/**
 ******************************************************************************
 ** ファイル名 : Driver.h
 ** クラス名   : Driver
 **
 ** 概要 : 走行体に指示するクラス
 ******************************************************************************
 **/
#ifndef RUNNER_DRIVER_H
#define RUNNER_DRIVER_H

#include "Runner.h"
#include "../scenario/Course.h"
// #include "scenario/シナリオ.h"

class Driver
{
private:
    Runner* runner;
    Course course[12] =  {
        {     0, 100,  0,  5, 0.0500F, 0.0000F, 1.0000F},
        {  2500, 100,  0,  5, 0.0500F, 0.0000F, 1.0000F},
        {  4000,  96,  0,  5, 0.1300F, 0.0001F, 1.2000F},
        {  5700, 100,  0,  5, 0.0500F, 0.0000F, 1.0000F},
        {  6400,  96,  0,  5, 0.1350F, 0.0001F, 1.2500F},
        {  6800, 100,  0,  5, 0.0500F, 0.0000F, 1.0000F},
        {  7600,  96,  0,  5, 0.1400F, 0.0001F, 1.3000F},
        { 10000, 100,  0,  5, 0.0500F, 0.0000F, 1.0000F},
        { 10700,  80,  0,  5, 0.1000F, 0.0001F, 1.0000F},
        { 10850,  96,  0,  5, 0.0000F, 0.0000F, 0.0000F},
        { 10850,  96,  0,  5, 0.1000F, 0.0001F, 0.0000F},
        { 99999,   1, 85,  5, 0.0000F, 0.0000F, 0.0000F}
    };
    int courseNumber = 0;
    // scenario::シナリオ senarios[];
    // scenario::シナリオ シナリオ;

public:
    Driver();
    void start();
    void exec();
    void btTask();
    // void 区間を渡す();

};
#endif  // RUNNER_DRIVER_H
