/**
 ******************************************************************************
 ** ファイル名 : Driver.h
 ** クラス名   : Driver
 **
 ** 概要 : 走行体に指示するクラス
 ******************************************************************************
 **/
#ifndef RUNNER_DRIVER_H
#define RUNNER_DRIVER_H

#include "Runner.h"
#include "../scenario/Course.h"
// #include "scenario/シナリオ.h"

class Driver
{
private:
    Runner* runner;
    Course course[10] =  {
        {    0,  90,  0, 0.0500F, 0.0000F, 1.2000F },
        { 2000,  90,  0, 0.1300F, 0.0001F, 1.2000F },
        { 3927,  90,  0, 0.1000F, 0.0001F, 1.2000F },
        { 4754,  90,  0, 0.1000F, 0.0000F, 1.2000F },
        { 5209,  90,  0, 0.1000F, 0.0001F, 1.2000F },
        { 6134,  90,  0, 0.1000F, 0.0000F, 1.2000F },
        { 6674,  90,  0, 0.1300F, 0.0001F, 1.2000F },
        { 7562,  90,  0, 0.1300F, 0.0001F, 1.2000F },
        { 8800,  90,  0, 0.0500F, 0.0000F, 1.2000F },
        { 9932,   1,  0, 0.0000F, 0.0000F, 0.0000F }
    };
    // scenario::シナリオ senarios[];
    // scenario::シナリオ シナリオ;

public:
    Driver();
    void start();
    void exec();
    void bt_task();
    // void 区間を渡す();

};
#endif  // RUNNER_DRIVER_H
